avr-rust/avrd/packs/xmegaa/ATxmega128A1U.atdf
          <instance name="ADCB">
            <register-group address-space="data" offset="0x0240" name-in-module="ADC" name="ADCB"/>
            <signals>
              <signal function="ADCPOS" group="ADC" index="0" pad="PB0"/>
              <signal function="ADCPOS" group="ADC" index="1" pad="PB1"/>
              <signal function="ADCPOS" group="ADC" index="2" pad="PB2"/>
              <signal function="ADCPOS" group="ADC" index="3" pad="PB3"/>
              <signal function="ADCPOS" group="ADC" index="4" pad="PB4"/>
              <signal function="ADCPOS" group="ADC" index="5" pad="PB5"/>
              <signal function="ADCPOS" group="ADC" index="6" pad="PB6"/>
              <signal function="ADCPOS" group="ADC" index="7" pad="PB7"/>
              <signal function="GAINPOS" group="ADC" index="0" pad="PB0"/>
              <signal function="GAINPOS" group="ADC" index="1" pad="PB1"/>
              <signal function="GAINPOS" group="ADC" index="2" pad="PB2"/>
              <signal function="GAINPOS" group="ADC" index="3" pad="PB3"/>
              <signal function="GAINPOS" group="ADC" index="4" pad="PB4"/>
              <signal function="GAINPOS" group="ADC" index="5" pad="PB5"/>
              <signal function="GAINPOS" group="ADC" index="6" pad="PB6"/>
              <signal function="GAINPOS" group="ADC" index="7" pad="PB7"/>
              <signal function="ADCNEG" group="ADC" index="4" pad="PB4"/>
              <signal function="ADCNEG" group="ADC" index="5" pad="PB5"/>
              <signal function="ADCNEG" group="ADC" index="6" pad="PB6"/>
              <signal function="ADCNEG" group="ADC" index="7" pad="PB7"/>
              <signal function="GAINNEG" group="ADC" index="4" pad="PB4"/>
              <signal function="GAINNEG" group="ADC" index="5" pad="PB5"/>
              <signal function="GAINNEG" group="ADC" index="6" pad="PB6"/>
              <signal function="GAINNEG" group="ADC" index="7" pad="PB7"/>
              <signal function="AREF" group="REFA" index="0" pad="PA0"/>
              <signal function="AREF" group="REFB" index="0" pad="PB0"/>
            </signals>
          </instance>
        </module>
        <module name="DAC" id="I6059" version="XMEGAAU">
          <instance name="DACA">
            <register-group address-space="data" offset="0x0300" name-in-module="DAC" name="DACA"/>
            <signals>
              <signal function="DAC" group="DAC" index="0" pad="PA2"/>
              <signal function="DAC" group="DAC" index="1" pad="PA3"/>
			  <signal function="AREF" group="REFA" index="0" pad="PA0"/>
              <signal function="AREF" group="REFB" index="0" pad="PB0"/>
            </signals>
          </instance>
          <instance name="DACB">
            <register-group address-space="data" offset="0x0320" name-in-module="DAC" name="DACB"/>
            <signals>
              <signal function="DAC" group="DAC" index="0" pad="PB2"/>
              <signal function="DAC" group="DAC" index="1" pad="PB3"/>
			  <signal function="AREF" group="REFA" index="0" pad="PA0"/>
              <signal function="AREF" group="REFB" index="0" pad="PB0"/>
            </signals>
          </instance>
        </module>
        <module name="AC" id="I6077" version="XMEGAAU">
          <instance name="ACA">
            <register-group address-space="data" offset="0x0380" name-in-module="AC" name="ACA"/>
            <signals>
              <signal function="ACPOS" group="AC" index="0" pad="PA0"/>
              <signal function="ACPOS" group="AC" index="1" pad="PA1"/>
              <signal function="ACPOS" group="AC" index="2" pad="PA2"/>
              <signal function="ACPOS" group="AC" index="3" pad="PA3"/>
              <signal function="ACPOS" group="AC" index="4" pad="PA4"/>
              <signal function="ACPOS" group="AC" index="5" pad="PA5"/>
              <signal function="ACPOS" group="AC" index="6" pad="PA6"/>
              <signal function="ACNEG" group="AC" index="0" pad="PA0"/>
              <signal function="ACNEG" group="AC" index="1" pad="PA1"/>
              <signal function="ACNEG" group="AC" index="3" pad="PA3"/>
              <signal function="ACNEG" group="AC" index="5" pad="PA5"/>
              <signal function="ACNEG" group="AC" index="7" pad="PA7"/>
              <signal function="ACOUT" group="ACOUT" index="1" pad="PA6"/>
              <signal function="ACOUT" group="ACOUT" index="0" pad="PA7"/>
            </signals>
          </instance>
          <instance name="ACB">
            <register-group address-space="data" offset="0x0390" name-in-module="AC" name="ACB"/>
            <signals>
              <signal function="ACPOS" group="AC" index="0" pad="PB0"/>
              <signal function="ACPOS" group="AC" index="1" pad="PB1"/>
              <signal function="ACPOS" group="AC" index="2" pad="PB2"/>
              <signal function="ACPOS" group="AC" index="3" pad="PB3"/>
              <signal function="ACPOS" group="AC" index="4" pad="PB4"/>
              <signal function="ACPOS" group="AC" index="5" pad="PB5"/>
              <signal function="ACPOS" group="AC" index="6" pad="PB6"/>
              <signal function="ACNEG" group="AC" index="0" pad="PB0"/>
              <signal function="ACNEG" group="AC" index="1" pad="PB1"/>
              <signal function="ACNEG" group="AC" index="3" pad="PB3"/>
              <signal function="ACNEG" group="AC" index="5" pad="PB5"/>
              <signal function="ACNEG" group="AC" index="7" pad="PB7"/>
              <signal function="ACOUT" group="ACOUT" index="1" pad="PB6"/>
              <signal function="ACOUT" group="ACOUT" index="0" pad="PB7"/>
            </signals>
          </instance>
        </module>
        <module name="RTC" id="I6093">
          <instance name="RTC">
            <register-group address-space="data" offset="0x0400" name-in-module="RTC" name="RTC"/>
          </instance>
        </module>
        <module name="EBI" id="I3001">
          <instance name="EBI">
            <register-group address-space="data" offset="0x0440" name-in-module="EBI" name="EBI"/>
            <signals>
              <signal function="EBIPORT0" group="PORT0" index="0" pad="PH0"/>
              <signal function="EBIPORT0" group="PORT0" index="1" pad="PH1"/>
              <signal function="EBIPORT0" group="PORT0" index="2" pad="PH2"/>
              <signal function="EBIPORT0" group="PORT0" index="3" pad="PH3"/>
              <signal function="EBIPORT0" group="PORT0" index="4" pad="PH4"/>
              <signal function="EBIPORT0" group="PORT0" index="5" pad="PH5"/>
              <signal function="EBIPORT0" group="PORT0" index="6" pad="PH6"/>
              <signal function="EBIPORT0" group="PORT0" index="7" pad="PH7"/>
              <signal function="EBIPORT1" group="PORT1" index="0" pad="PJ0"/>
              <signal function="EBIPORT1" group="PORT1" index="1" pad="PJ1"/>
              <signal function="EBIPORT1" group="PORT1" index="2" pad="PJ2"/>
              <signal function="EBIPORT1" group="PORT1" index="3" pad="PJ3"/>
              <signal function="EBIPORT1" group="PORT1" index="4" pad="PJ4"/>
              <signal function="EBIPORT1" group="PORT1" index="5" pad="PJ5"/>
              <signal function="EBIPORT1" group="PORT1" index="6" pad="PJ6"/>
              <signal function="EBIPORT1" group="PORT1" index="7" pad="PJ7"/>
              <signal function="EBIPORT2" group="PORT2" index="0" pad="PK0"/>
              <signal function="EBIPORT2" group="PORT2" index="1" pad="PK1"/>
              <signal function="EBIPORT2" group="PORT2" index="2" pad="PK2"/>
              <signal function="EBIPORT2" group="PORT2" index="3" pad="PK3"/>
              <signal function="EBIPORT2" group="PORT2" index="4" pad="PK4"/>
              <signal function="EBIPORT2" group="PORT2" index="5" pad="PK5"/>
              <signal function="EBIPORT2" group="PORT2" index="6" pad="PK6"/>
              <signal function="EBIPORT2" group="PORT2" index="7" pad="PK7"/>
              <signal function="EBIPORT3" group="PORT3" index="0" pad="PF0"/>
              <signal function="EBIPORT3" group="PORT3" index="1" pad="PF1"/>
              <signal function="EBIPORT3" group="PORT3" index="2" pad="PF2"/>
              <signal function="EBIPORT3" group="PORT3" index="3" pad="PF3"/>
              <signal function="EBIPORT3" group="PORT3" index="4" pad="PF4"/>
              <signal function="EBIPORT3" group="PORT3" index="5" pad="PF5"/>
              <signal function="EBIPORT3" group="PORT3" index="6" pad="PF6"/>
              <signal function="EBIPORT3" group="PORT3" index="7" pad="PF7"/>
            </signals>
          </instance>
        </module>
        <module name="TWI" id="I6089">
          <instance name="TWIC">
            <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
            <signals>
              <signal function="TWIC" group="SDA" pad="PC0"/>
              <signal function="TWIC" group="SCL" pad="PC1"/>
            </signals>
          </instance>
