avr-rust/avrd/packs/xmegaa/ATxmega128A1U.atdf
          <instance name="PORTK">
            <register-group address-space="data" offset="0x0720" name-in-module="PORT" name="PORTK"/>
            <signals>
              <signal function="PORTK" group="P" index="0" pad="PK0"/>
              <signal function="PORTK" group="P" index="1" pad="PK1"/>
              <signal function="PORTK" group="P" index="2" pad="PK2"/>
              <signal function="PORTK" group="P" index="3" pad="PK3"/>
              <signal function="PORTK" group="P" index="4" pad="PK4"/>
              <signal function="PORTK" group="P" index="5" pad="PK5"/>
              <signal function="PORTK" group="P" index="6" pad="PK6"/>
              <signal function="PORTK" group="P" index="7" pad="PK7"/>
            </signals>
          </instance>
          <instance name="PORTQ">
            <register-group address-space="data" offset="0x07C0" name-in-module="PORT" name="PORTQ"/>
            <signals>
              <signal function="PORTQ" group="P" index="0" pad="PQ0"/>
              <signal function="PORTQ" group="P" index="1" pad="PQ1"/>
              <signal function="PORTQ" group="P" index="2" pad="PQ2"/>
              <signal function="PORTQ" group="P" index="3" pad="PQ3"/>
            </signals>
          </instance>
          <instance name="PORTR">
            <register-group address-space="data" offset="0x07E0" name-in-module="PORT" name="PORTR"/>
            <signals>
              <signal function="PORTR" group="P" index="0" pad="PR0"/>
              <signal function="PORTR" group="P" index="1" pad="PR1"/>
            </signals>
          </instance>
        </module>
        <module name="TC" id="I6090" version="XMEGAAU">
          <instance name="TCC0">
            <register-group address-space="data" offset="0x800" name-in-module="TC0" name="TCC0"/>
            <signals>
              <signal function="TCC" group="OC0A" pad="PC0"/>
              <signal function="TCC" group="OC0B" pad="PC1"/>
              <signal function="TCC" group="OC0C" pad="PC2"/>
              <signal function="TCC" group="OC0D" pad="PC3"/>
              <signal function="TCC_ALT" group="OC0A" pad="PC4"/>
              <signal function="TCC_ALT" group="OC0B" pad="PC5"/>
              <signal function="TCC_ALT" group="OC0C" pad="PC6"/>
              <signal function="TCC_ALT" group="OC0D" pad="PC7"/>
            </signals>
          </instance>
          <instance name="TCC1">
            <register-group address-space="data" offset="0x840" name-in-module="TC1" name="TCC1"/>
            <signals>
              <signal function="TCC" group="OC1A" pad="PC4"/>
              <signal function="TCC" group="OC1B" pad="PC5"/>
            </signals>
          </instance>
          <instance name="TCD0">
            <register-group address-space="data" offset="0x900" name-in-module="TC0" name="TCD0"/>
            <signals>
              <signal function="TCD" group="OC0A" pad="PD0"/>
              <signal function="TCD" group="OC0B" pad="PD1"/>
              <signal function="TCD" group="OC0C" pad="PD2"/>
              <signal function="TCD" group="OC0D" pad="PD3"/>
            </signals>
          </instance>
          <instance name="TCD1">
            <register-group address-space="data" offset="0x940" name-in-module="TC1" name="TCD1"/>
            <signals>
              <signal function="TCD" group="OC1A" pad="PD4"/>
              <signal function="TCD" group="OC1B" pad="PD5"/>
            </signals>
          </instance>
          <instance name="TCE0">
            <register-group address-space="data" offset="0xA00" name-in-module="TC0" name="TCE0"/>
            <signals>
              <signal function="TCE0" group="OC0A" pad="PE0"/>
              <signal function="TCE0" group="OC0B" pad="PE1"/>
              <signal function="TCE0" group="OC0C" pad="PE2"/>
              <signal function="TCE0" group="OC0D" pad="PE3"/>
            </signals>
          </instance>
          <instance name="TCE1">
            <register-group address-space="data" offset="0xA40" name-in-module="TC1" name="TCE1"/>
            <signals>
              <signal function="TCE1" group="OC1A" pad="PE4"/>
              <signal function="TCE1" group="OC1B" pad="PE5"/>
            </signals>
          </instance>
          <instance name="TCF0">
            <register-group address-space="data" offset="0xB00" name-in-module="TC0" name="TCF0"/>
            <signals>
              <signal function="TCF0" group="OC0A" pad="PF0"/>
              <signal function="TCF0" group="OC0B" pad="PF1"/>
              <signal function="TCF0" group="OC0C" pad="PF2"/>
              <signal function="TCF0" group="OC0D" pad="PF3"/>
            </signals>
          </instance>
          <instance name="TCF1">
            <register-group address-space="data" offset="0xB40" name-in-module="TC1" name="TCF1"/>
            <signals>
              <signal function="TCF1" group="OC1A" pad="PF4"/>
              <signal function="TCF1" group="OC1B" pad="PF5"/>
            </signals>
          </instance>
        </module>
        <module name="TC2" id="I6090" version="XMEGAAU">
          <instance name="TCC2">
            <register-group address-space="data" offset="0x800" name-in-module="TC2" name="TCC2"/>
            <signals>
              <signal function="TCC2" group="LOC2A" pad="PC0"/>
              <signal function="TCC2" group="LOC2B" pad="PC1"/>
              <signal function="TCC2" group="LOC2C" pad="PC2"/>
              <signal function="TCC2" group="LOC2D" pad="PC3"/>
              <signal function="TCC2" group="HOC2A" pad="PC4"/>
              <signal function="TCC2" group="HOC2B" pad="PC5"/>
              <signal function="TCC2" group="HOC2C" pad="PC6"/>
              <signal function="TCC2" group="HOC2D" pad="PC7"/>
            </signals>
          </instance>
          <instance name="TCD2">
            <register-group address-space="data" offset="0x900" name-in-module="TC2" name="TCD2"/>
            <signals>
              <signal function="TCD2" group="LOC2A" pad="PD0"/>
              <signal function="TCD2" group="LOC2B" pad="PD1"/>
              <signal function="TCD2" group="LOC2C" pad="PD2"/>
              <signal function="TCD2" group="LOC2D" pad="PD3"/>
              <signal function="TCD2" group="HOC2A" pad="PD4"/>
              <signal function="TCD2" group="HOC2B" pad="PD5"/>
              <signal function="TCD2" group="HOC2C" pad="PD6"/>
              <signal function="TCD2" group="HOC2D" pad="PD7"/>
            </signals>
          </instance>
