avr-rust/avrd/packs/xmegaa/ATxmega128A1U.atdf
      <register-group caption="External Bus Interface" name="EBI" size="32">
        <register caption="Control" name="CTRL" offset="0x00" size="1">
          <bitfield caption="SDRAM Data Width Setting" mask="0xC0" name="SDDATAW" values="EBI_SDDATAW"/>
          <bitfield caption="SRAM LPC Mode" mask="0x30" name="LPCMODE" values="EBI_LPCMODE"/>
          <bitfield caption="SRAM Mode" mask="0x0C" name="SRMODE" values="EBI_SRMODE"/>
          <bitfield caption="Interface Mode" mask="0x03" name="IFMODE" values="EBI_IFMODE"/>
        </register>
        <register caption="SDRAM Control Register A" name="SDRAMCTRLA" offset="0x01" size="1">
          <bitfield caption="SDRAM CAS Latency Setting" mask="0x08" name="SDCAS"/>
          <bitfield caption="SDRAM ROW Bits Setting" mask="0x04" name="SDROW"/>
          <bitfield caption="SDRAM Column Bits Setting" mask="0x03" name="SDCOL" values="EBI_SDCOL"/>
        </register>
        <register caption="SDRAM Refresh Period" name="REFRESH" offset="0x04" size="2"/>
        <register caption="SDRAM Initialization Delay" name="INITDLY" offset="0x06" size="2"/>
        <register caption="SDRAM Control Register B" name="SDRAMCTRLB" offset="0x08" size="1">
          <bitfield caption="SDRAM Mode Register Delay" mask="0xC0" name="MRDLY" values="EBI_MRDLY"/>
          <bitfield caption="SDRAM Row Cycle Delay" mask="0x38" name="ROWCYCDLY" values="EBI_ROWCYCDLY"/>
          <bitfield caption="SDRAM Row-to-Precharge Delay" mask="0x07" name="RPDLY" values="EBI_RPDLY"/>
        </register>
        <register caption="SDRAM Control Register C" name="SDRAMCTRLC" offset="0x09" size="1">
          <bitfield caption="SDRAM Write Recovery Delay" mask="0xC0" name="WRDLY" values="EBI_WRDLY"/>
          <bitfield caption="SDRAM Exit-Self-refresh-to-Active Delay" mask="0x38" name="ESRDLY" values="EBI_ESRDLY"/>
          <bitfield caption="SDRAM Row-to-Column Delay" mask="0x07" name="ROWCOLDLY" values="EBI_ROWCOLDLY"/>
        </register>
        <register-group caption="Chip Select 0" name="CS0" offset="0x10" name-in-module="EBI_CS"/>
        <register-group caption="Chip Select 1" name="CS1" offset="0x14" name-in-module="EBI_CS"/>
        <register-group caption="Chip Select 2" name="CS2" offset="0x18" name-in-module="EBI_CS"/>
        <register-group caption="Chip Select 3" name="CS3" offset="0x1C" name-in-module="EBI_CS"/></register-group>
      <value-group caption="Chip Select adress size" name="EBI_CS_ASIZE">
        <value caption="256 bytes" name="256B" value="0x00"/>
        <value caption="512 bytes" name="512B" value="0x01"/>
        <value caption="1K bytes" name="1KB" value="0x02"/>
        <value caption="2K bytes" name="2KB" value="0x03"/>
        <value caption="4K bytes" name="4KB" value="0x04"/>
        <value caption="8K bytes" name="8KB" value="0x05"/>
        <value caption="16K bytes" name="16KB" value="0x06"/>
        <value caption="32K bytes" name="32KB" value="0x07"/>
        <value caption="64K bytes" name="64KB" value="0x08"/>
        <value caption="128K bytes" name="128KB" value="0x09"/>
        <value caption="256K bytes" name="256KB" value="0x0A"/>
        <value caption="512K bytes" name="512KB" value="0x0B"/>
        <value caption="1M bytes" name="1MB" value="0x0C"/>
        <value caption="2M bytes" name="2MB" value="0x0D"/>
        <value caption="4M bytes" name="4MB" value="0x0E"/>
        <value caption="8M bytes" name="8MB" value="0x0F"/>
        <value caption="16M bytes" name="16M" value="0x10"/>
      </value-group>
      <value-group caption="Legacy: Chip Select adress space" name="EBI_CS_ASPACE">
        <value caption="256 bytes" name="256B" value="0x00"/>
        <value caption="512 bytes" name="512B" value="0x01"/>
        <value caption="1K bytes" name="1KB" value="0x02"/>
        <value caption="2K bytes" name="2KB" value="0x03"/>
        <value caption="4K bytes" name="4KB" value="0x04"/>
        <value caption="8K bytes" name="8KB" value="0x05"/>
        <value caption="16K bytes" name="16KB" value="0x06"/>
        <value caption="32K bytes" name="32KB" value="0x07"/>
        <value caption="64K bytes" name="64KB" value="0x08"/>
        <value caption="128K bytes" name="128KB" value="0x09"/>
        <value caption="256K bytes" name="256KB" value="0x0A"/>
        <value caption="512K bytes" name="512KB" value="0x0B"/>
        <value caption="1M bytes" name="1MB" value="0x0C"/>
        <value caption="2M bytes" name="2MB" value="0x0D"/>
        <value caption="4M bytes" name="4MB" value="0x0E"/>
        <value caption="8M bytes" name="8MB" value="0x0F"/>
        <value caption="16M bytes" name="16M" value="0x10"/>
      </value-group>
      <value-group caption="SRAM Wait State Selection" name="EBI_CS_SRWS">
        <value caption="0 cycles" name="0CLK" value="0x00"/>
        <value caption="1 cycle" name="1CLK" value="0x01"/>
        <value caption="2 cycles" name="2CLK" value="0x02"/>
        <value caption="3 cycles" name="3CLK" value="0x03"/>
        <value caption="4 cycles" name="4CLK" value="0x04"/>
        <value caption="5 cycles" name="5CLK" value="0x05"/>
        <value caption="6 cycles" name="6CLK" value="0x06"/>
        <value caption="7 cycles" name="7CLK" value="0x07"/>
      </value-group>
      <value-group caption="Chip Select address mode" name="EBI_CS_MODE">
        <value caption="Chip Select Disabled" name="DISABLED" value="0x00"/>
        <value caption="Chip Select in SRAM mode" name="SRAM" value="0x01"/>
        <value caption="Chip Select in SRAM LPC mode" name="LPC" value="0x02"/>
        <value caption="Chip Select in SDRAM mode" name="SDRAM" value="0x03"/>
      </value-group>
      <value-group caption="Chip Select SDRAM mode" name="EBI_CS_SDMODE">
        <value caption="Normal mode" name="NORMAL" value="0x00"/>
        <value caption="Load Mode Register command mode" name="LOAD" value="0x01"/>
      </value-group>
      <value-group caption="" name="EBI_SDDATAW">
        <value caption="4-bit data bus" name="4BIT" value="0x00"/>
        <value caption="8-bit data bus" name="8BIT" value="0x01"/>
      </value-group>
      <value-group caption="" name="EBI_LPCMODE">
        <value caption="Data muxed with addr byte 0" name="ALE1" value="0x00"/>
        <value caption="Data muxed with addr byte 0 and 1" name="ALE12" value="0x02"/>
      </value-group>
      <value-group caption="" name="EBI_SRMODE">
        <value caption="Addr byte 0 muxed with 1" name="ALE1" value="0x00"/>
        <value caption="Addr byte 0 muxed with 2" name="ALE2" value="0x01"/>
        <value caption="Addr byte 0 muxed with 1 and 2" name="ALE12" value="0x02"/>
        <value caption="No addr muxing" name="NOALE" value="0x03"/>
      </value-group>
      <value-group caption="" name="EBI_IFMODE">
        <value caption="EBI Disabled" name="DISABLED" value="0x00"/>
        <value caption="3-port mode" name="3PORT" value="0x01"/>
        <value caption="4-port mode" name="4PORT" value="0x02"/>
        <value caption="2-port mode" name="2PORT" value="0x03"/>
      </value-group>
      <value-group caption="" name="EBI_SDCOL">
        <value caption="8 column bits" name="8BIT" value="0x00"/>
        <value caption="9 column bits" name="9BIT" value="0x01"/>
        <value caption="10 column bits" name="10BIT" value="0x02"/>
        <value caption="11 column bits" name="11BIT" value="0x03"/>
      </value-group>
